brew "git"
brew "git-delta"
brew "git-cliff"
brew "stow"
brew "make"
brew "jq"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "direnv"
brew "gh"
brew "glab"
brew "watchman"
brew "coreutils"
brew "wget"
brew "eza"
brew "bat"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ansible"
brew "dockutil"
brew "kubernetes-cli"
brew "helm"
brew "openssl@3"
brew "libyaml"
brew "gmp"
brew "pkg-config"
brew "readline"
brew "libffi"
brew "mise"
brew "starship"
brew "lazygit"

# Modern CLI tools
brew "yazi"              # Terminal file manager
brew "zoxide"            # Smarter cd command
brew "atuin"             # Shell history with sync
brew "neovim"            # Modern vim

# Additional dev tools
brew "tlrc"              # Rust tldr client
brew "hyperfine"         # CLI benchmarking
brew "dust"              # Better du
brew "bottom"            # Better top/htop
brew "procs"             # Better ps
brew "tokei"             # Code statistics
brew "lazydocker"        # Docker TUI
brew "httpie"            # Better curl for APIs
brew "xh"                # Even faster httpie alternative
brew "gemini-cli"        # Google Gemini CLI
